[
  {
    "title": "I (18F) want to breakup with my (19M) boyfriend, but I can't without possibly ruining my own life.",
    "full_story": "As the title suggests, I (18F) want to break up with my boyfriend (19M). I met him about two years ago, and I instantly fell in love with him. We began dating weeks after we met and had a great relationship until we started fighting a lot towards the end. It’s worth noting that he was also deeply in love with me and insisted that I was the person he loved most in the world and couldn't imagine being with anyone else.\n\nHowever, by the end of our first year together, the relationship deteriorated rapidly due to constant fighting. He was also mentally unstable, which took a toll on his mental health. Eventually, he decided to break up with me, despite my begging him not to. I was devastated for the first couple of months, but I began picking up interests and joining social groups on Discord to combat the crippling loneliness I felt, especially since I didn’t have any friends at that time. During this period, I met another guy who helped me figure out what I wanted in life and understand my own sexuality. I truly believe I’ll never find someone as compatible with me as my ex was.\n\nAnyway, after about ten months apart, he called me out of the blue on Valentine's Day. He had never tried to contact me before or reconnect, so I was surprised to hear from him. We started chatting, and he apologized for how things ended, expressing his feelings at the time and asking for another chance. By that point, I had mostly moved on and rarely thought about him anymore, but I agreed to meet up. He started overwhelming me with gifts and anything I asked for, which ultimately felt smothering. I quickly went back to him again, and we have been together since.\n\nInitially, everything went well, but he quit his job a month into our relationship due to a severe mental breakdown, which I helped him through. I was constantly worried about him, and that burden became overwhelming. I hoped to rekindle the love I felt for him before we broke up, but it has been challenging to feel that way again. Our sex life often leaves me unsatisfied because he doesn't seem to listen to my requests or desires, and I overall don't feel free with him.\n\nI realize I no longer want this relationship that limits me from living my life as I truly want to. The problem is that he is extremely suicidal; he has made it clear that he would harm himself if I leave. While he hasn’t explicitly threatened me, it's obvious from the things he says. I believe he is fully capable of following through with such actions, as he has already attempted suicide twice during our time back together (for unrelated reasons), and he only failed because I managed to call for help. I just wouldn’t be able to bare the guilt and deal with the consequences of him committing if I were to leave.\n\nI genuinely care for him, and the thought of leaving fills me with guilt. I feel selfish for wanting to end this relationship, even though he loves me and tries his best. Despite that, I can’t shake the feeling of being unsatisfied in many aspects and unable to reciprocate his feelings anymore.\n\n\nTLDR; I (18F) want to break up with my boyfriend (19M). We started strong two years ago, but constant fighting and his mental instability took a toll. After a tough breakup, I moved on but he reached out on Valentine's Day, and we got back together. Things initially improved, but after he quit his job due to a breakdown, I felt overwhelmed by caring for him. I'm unsatisfied in the relationship, especially with intimacy, and I don't feel free to live my life.\nThe dilemma is that he has expressed suicidal thoughts if I leave. I care for him, but I feel guilty for wanting to end things when he's in such a vulnerable state.",
    "story_length": 3688,
    "author": "ab_REDACTED",
    "score": 214,
    "num_comments": 47,
    "url": "https://www.reddit.com/r/relationships/comments/1maszyo/i_18f_want_to_breakup_with_my_19m_boyfriend_but_i/",
    "permalink": "/r/relationships/comments/1maszyo/i_18f_want_to_breakup_with_my_19m_boyfriend_but_i/",
    "subreddit": "relationships",
    "created_utc": 1753639238.0,
    "created_date": "2025-07-27 23:30:38",
    "has_comments": true,
    "top_comments": [
      {
        "author": "FieryBush",
        "score": 375,
        "body": "I've had two different exes express suicidal sentiments after leaving them, so believe me when I say that it's not your responsibility. I contacted their moms to let them know and then washed my hands of it, though I would have contacted 911 if I didn't think they were mentioning it mainly to manipulate (making me feel responsible for their emotions and well-being were common issues).\n\nI know it's easy to feel responsible for him, but the truth is, you're not - he is. If he's actually a threat to himself, the best thing you can do is contact 911 to report it. Look out for yourself and let professionals handle him."
      },
      {
        "author": "bromerk",
        "score": 846,
        "body": "Don’t let him manipulate you. Break up and call 911 if he threatens suicide. You’re 18, don’t waste anymore time with him."
      },
      {
        "author": "Complete_Hat6078",
        "score": 180,
        "body": "Inform his parents or friends or anyone who cares about him about his suicidal threats and then leave.  \nThis is manipulation and it's beyond unfair of him to make you feel responsible for his life. Ultimately you can't set yourself on fire to keep someone from burning."
      }
    ]
  }
]